# -*- mode:org; fill-column:79; -*-
#+Title:Exercism Exercises
#+Author:Pinecone062
#+Date:Last updated 2019-05-25 13:34
#+Macro: version Version 0.2.0
{{{title}}} {{{version}}} {{{date}}}
** Exercism CLI
- https://github.com/exercism/cli

To install manually, download the appropriate version of exercism based on your
processor architecture at the [[https://github.com/exercism/cli/releases/latest][releases page]], then extract the archive and put
the binary in your path.

Check the installed version with:

#+BEGIN_SRC sh :results output :exports both
exercism version
#+END_SRC

#+RESULTS:
: exercism version 3.0.11

In order to configure the CLI, paste in the following text into your terminal:
: exercism configure --token=b4b5ab41-b448-4762-a5ce-452ccd2eff08

 You should see a notification from the CLI that a configuration file has been
 written.

#+begin_src txt
You have configured the Exercism command-line client:

Config dir:                       ~/.config/exercism
Token:         (-t, --token)      b4b5ab41-b448-4762-a5ce-452ccd2eff08
Workspace:     (-w, --workspace)  <path-to>/Exercism
API Base URL:  (-a, --api)        https://api.exercism.io/v1
#+end_src

*** JavaScript Hello World Setup and Tests
1. Go through the setup instructions for Javascript to install the necessary
   dependencies:
   - https://exercism.io/tracks/javascript/installation

2. Install assignment dependencies:
   This step will run automatically upon an export of this Org file.

   #+name:javascript-hello-world-install
   #+begin_src sh :dir javascript/hello-world :results output :exports both
   yarn install
   #+end_src

   #+RESULTS: javascript-hello-world-install
   : yarn install v1.16.0
   : info No lockfile found.
   : [1/4] Resolving packages...
   : [2/4] Fetching packages...
   : [3/4] Linking dependencies...
   : [4/4] Building fresh packages...
   : success Saved lockfile.
   : Done in 9.77s.

3. After completing the code challenge, Execute the tests.

   This step will also run automatically upon an export of this Org file.

   #+name:javascript-hello-world-run-lint-test
   #+begin_src sh :dir javascript/hello-world :results output :exports both
   yarn lint-test 2>&1
   #+end_src

   #+RESULTS: javascript-hello-world-run-lint-test
   #+begin_example
   yarn run v1.16.0
   $ eslint . && jest --no-cache ./* 
   PASS ./hello-world.spec.js
     Hello World
       ✓ says hello (3ms)

   Test Suites: 1 passed, 1 total
   Tests:       1 passed, 1 total
   Snapshots:   0 total
   Time:        0.842s
   Ran all test suites matching /.\/README.md|.\/babel.config.js|.\/hello-world.js|.\/hello-world.spec.js|.\/node_modules|.\/package.json|.\/yarn.lock/i.
   Done in 1.91s.
   #+end_example

   In the test suites all tests but the first have been skipped.  Once you get
   a test passing, you can enable the next one by changing ~xtest~ to ~test~.

4. Submit Passing code to Exercism

  This step should be done manually after this Org file correctly installs the
  project and successfully runs the test.

  #+name:javascript-hello-world-submit
  #+begin_src sh :dir javascript/hello-world :results output
  exercism submit $PWD/hello-world.js
  #+end_src

  #+RESULTS: javascript-hello-world-submit
  :     https://exercism.io/my/solutions/3e83e95453cb4b2e8d0a68027687fe72

** JavaScript Two Fer
- https://exercism.io/my/solutions/0d6a508dc6cb4f2282e2cfc2f5274acf

To download the code manually:
#+name:javascript-two-fer-download
#+begin_src sh :results output
exercism download --exercise=two-fer --track=javascript
#+end_src

#+RESULTS: javascript-two-fer-download
: /Users/pine/Dev/Programming/Languages/Exercism/javascript/two-fer

When ready to submit working code:
#+name:javascript-two-fer-submit
#+begin_src sh :dir javascript/two-fer :results output
exercism submit ./two-fer.js
#+end_src

#+RESULTS: javascript-two-fer-submit
:     https://exercism.io/my/solutions/0d6a508dc6cb4f2282e2cfc2f5274acf

*** JavaScript Two Fer Installation and Testing
#+name:javascript-two-fer-package-installation
#+begin_src sh :dir javascript/two-fer :results output :exports both
yarn
#+end_src

#+name:javascript-two-fer-testing
#+begin_src sh :dir javascript/two-fer :results output :exports both
yarn lint-test 2>&1
#+end_src

#+RESULTS: javascript-two-fer-testing
#+begin_example
yarn run v1.16.0
$ eslint . && jest --no-cache ./* 
PASS ./two-fer.spec.js
  twoFer()
    ✓ no name given (3ms)
    ✓ a name given (1ms)
    ✓ another name given

Test Suites: 1 passed, 1 total
Tests:       3 passed, 3 total
Snapshots:   0 total
Time:        0.856s
Ran all test suites matching /.\/README.md|.\/babel.config.js|.\/node_modules|.\/package.json|.\/two-fer.js|.\/two-fer.spec.js|.\/yarn.lock/i.
Done in 1.95s.
#+end_example

*** JavaScript Resistor Color Scripts
{{{heading(Download Source Code)}}}

This step does not normally need to be done other during initial setup of the
Org file.

#+name:javascript-resistor-color-download
#+begin_src sh :results output
exercism download --exercise=resistor-color --track=javascript
#+end_src

#+RESULTS: javascript-resistor-color-download
: /Users/pine/Dev/Programming/Languages/Exercism/javascript/resistor-color

{{{heading(Submit)}}}

This step is done only once, after all the tests are passing.

#+name:javascript-resistor-color-submit
#+begin_src sh :dir javascript/resistor-color :results output
exercism submit resistor-color.js
#+end_src

#+RESULTS: javascript-resistor-color-submit

{{{heading(Install Dependencies)}}}

This step is done automatically upon an export of this Org source file.  There
is no reason to run this script manually unless the source file is not being
exported.

#+name:javascript-resistor-color-install
#+begin_src sh :dir javascript/resistor-color :results output :exports both
yarn
#+end_src

{{{heading(Test Solution Code)}}}

This step is done automatically upon an export of this Org source file.  During
coding, it can be done manually to test your code from within this Org source
file.

#+name:javascript/resistor-color-test-solution
#+begin_src sh :dir javascript/resistor-color :results output :exports both
yarn lint-test 2>&1
#+end_src

#+RESULTS: javascript/resistor-color-test-solution
#+begin_example
yarn run v1.16.0
$ eslint . && jest --no-cache ./* 
PASS ./resistor-color.spec.js
  ResistorColor
    ✓ Colors (1ms)
    Color codes
      ✓ Black (2ms)
      ✓ White
      ✓ Orange

Test Suites: 1 passed, 1 total
Tests:       4 passed, 4 total
Snapshots:   0 total
Time:        0.836s
Ran all test suites matching /.\/README.md|.\/babel.config.js|.\/node_modules|.\/package.json|.\/resistor-color.js|.\/resistor-color.spec.js|.\/yarn.lock/i.
Done in 1.90s.
#+end_example

*** Python Hello World Test

#+name:Python-Hello-World-Test
#+begin_src python :tangle python/hello-world/hello_world_test.py :mkdirp yes
import unittest

import hello_world

# Tests adapted from `problem-specifications//canonical-data.json` @ v1.1.0

class HelloWorldTest(unittest.TestCase):
    def test_hello(self):
        self.assertEqual(hello_world.hello(), 'Hello, World!')


if __name__ == '__main__':
    unittest.main()
#+end_src

#+name:python-hello-world-test
#+begin_src sh :dir python/hello-world :results output :exports both
python3 -m pytest hello_world_test.py
#+end_src

#+RESULTS: python-hello-world-test
: ============================= test session starts ==============================
: platform darwin -- Python 3.7.3, pytest-4.4.1, py-1.8.0, pluggy-0.9.0
: rootdir: /usr/local/dev/programming/Languages/Exercism/python/hello-world
: collected 1 item
: 
: hello_world_test.py .                                                    [100%]
: 
: =========================== 1 passed in 0.10 seconds ===========================

*** Python Two Fer Solution
#+name:Two-Fer-Solution
#+begin_src python -n :tangle python/two-fer/two_fer.py :mkdirp yes
def two_fer(name="you"):
    return f"One for {name}, one for me."
#+end_src

#+begin_src sh :dir python/two-fer :results output
python3 -m pytest two_fer_test.py
#+end_src

#+RESULTS:
: ============================= test session starts ==============================
: platform darwin -- Python 3.7.3, pytest-4.4.1, py-1.8.0, pluggy-0.9.0
: rootdir: /usr/local/dev/programming/Languages/Exercism/python/two-fer
: collected 3 items
: 
: two_fer_test.py ...                                                      [100%]
: 
: =========================== 3 passed in 0.02 seconds ===========================

#+name:python-two-fer-metadata
#+BEGIN_SRC js :tangle python/two-fer/.exercism/metadata.json :mkdirp yes :exports none
{
    "track":"python",
    "exercise":"two-fer",
    "id":"80dbb050e4f041efa796149983871746",
    "url":"https://exercism.io/my/solutions/80dbb050e4f041efa796149983871746",
    "handle":"wlharvey4",
    "is_requester":true,
    "auto_approve":false
}
#+END_SRC

*** Python Two Fer Test
#+name:Python-Two-Fer-Test
#+begin_src python :tangle python/two-fer/two_fer_test.py :mkdirp yes
import unittest

from two_fer import two_fer


# Tests adapted from `problem-specifications//canonical-data.json` @ v1.2.0

class TwoFerTest(unittest.TestCase):
    def test_no_name_given(self):
        self.assertEqual(two_fer(), 'One for you, one for me.')

    def test_a_name_given(self):
        self.assertEqual(two_fer("Alice"), "One for Alice, one for me.")

    def test_another_name_given(self):
        self.assertEqual(two_fer("Bob"), "One for Bob, one for me.")


if __name__ == '__main__':
    unittest.main()
#+end_src

#+begin_src sh :dir python/two-fer :results output :exports both
python3 -m pytest two_fer_test.py
#+end_src

#+RESULTS:
: ============================= test session starts ==============================
: platform darwin -- Python 3.7.3, pytest-4.4.1, py-1.8.0, pluggy-0.9.0
: rootdir: /usr/local/dev/programming/Languages/Exercism/python/two-fer
: collected 3 items
: 
: two_fer_test.py ...                                                      [100%]
: 
: =========================== 3 passed in 0.06 seconds ===========================

*** Python High Scores Test
#+name:High_Scores_Python_Test
#+begin_src python :tangle python/high-scores/high_scores_test.py :mkdirp yes
import unittest

from high_scores import HighScores


# Tests adapted from `problem-specifications//canonical-data.json` @ v2.0.0


class HighScoreTest(unittest.TestCase):
    def test_list_of_scores(self):
        scores = [30, 50, 20, 70]
        expected = [30, 50, 20, 70]
        self.assertEqual(HighScores(scores).scores, expected)

    def test_latest_score(self):
        scores = [100, 0, 90, 30]
        expected = 30
        self.assertEqual(HighScores(scores).latest(), expected)

    def test_personal_best(self):
        scores = [40, 100, 70]
        expected = 100
        self.assertEqual(HighScores(scores).personal_best(), expected)

    def test_personal_top(self):
        scores = [50, 30, 10]
        expected = [50, 30, 10]
        self.assertEqual(HighScores(scores).personal_top(), expected)

    def test_personal_top_highest_to_lowest(self):
        scores = [20, 10, 30]
        expected = [30, 20, 10]
        self.assertEqual(HighScores(scores).personal_top(), expected)

    def test_personal_top_when_there_is_a_tie(self):
        scores = [40, 20, 40, 30]
        expected = [40, 40, 30]
        self.assertEqual(HighScores(scores).personal_top(), expected)

    def test_personal_top_when_there_are_less_than_3(self):
        scores = [30, 70]
        expected = [70, 30]
        self.assertEqual(HighScores(scores).personal_top(), expected)

    def test_personal_top_when_there_is_only_one(self):
        scores = [40]
        expected = [40]
        self.assertEqual(HighScores(scores).personal_top(), expected)

    def test_personal_top_from_a_long_list(self):
        scores = [10, 30, 90, 30, 100, 20, 10, 0, 30, 40, 40, 70, 70]
        expected = [100, 90, 70]
        self.assertEqual(HighScores(scores).personal_top(), expected)

    def test_message_for_new_personal_best(self):
        scores = [20, 40, 0, 30, 70]
        expected = "Your latest score was 70. That's your personal best!"
        self.assertEqual(HighScores(scores).report(), expected)

    def test_message_when_latest_score_is_not_the_highest_score(self):
        scores = [20, 100, 0, 30, 70]
        expected = (
            "Your latest score was 70. That's 30 short of your personal best!"
        )
        self.assertEqual(HighScores(scores).report(), expected)

    def test_message_for_repeated_personal_best(self):
        scores = [20, 70, 50, 70, 30]
        expected = (
            "Your latest score was 30. That's 40 short of your personal best!"
        )
        self.assertEqual(HighScores(scores).report(), expected)


if __name__ == "__main__":
    unittest.main()
#+end_src

#+name:Test_High_Score_Python
#+begin_src sh :dir python/high-scores :results output :exports both
python3 -m pytest high_scores_test.py
#+end_src

#+RESULTS: Test_High_Score_Python
: ============================= test session starts ==============================
: platform darwin -- Python 3.7.3, pytest-4.4.1, py-1.8.0, pluggy-0.9.0
: rootdir: /usr/local/dev/programming/Languages/Exercism/python/high-scores
: collected 12 items
: 
: high_scores_test.py ............                                         [100%]
: 
: ========================== 12 passed in 0.08 seconds ===========================

*** Perl5 Hello World Test
#+name:perl5-hello-world-test
#+BEGIN_SRC perl -n :tangle perl5/hello-world/t/hello-world.t :mkdirp yes
#!/usr/bin/env perl
use strict;
use warnings;
use Test::More tests => 2; # This is how many tests we expect to run.
use lib './lib';
use HelloWorld qw(hello);

can_ok 'HelloWorld', 'import' or BAIL_OUT 'Cannot import subroutines from module';

# Run the 'is' subroutine from the 'Test::More' module, with three arguments.
is(
  hello,           # Run the 'hello' subroutine, which is imported from your module.
  'Hello, World!', # The expected result to compare with 'hello'.
  'Say Hi!'        # The test description.
);
#+END_SRC

#+name:perl5-hello-world-run-test
#+BEGIN_SRC sh :dir perl5/hello-world :results output :exports both
prove ./t
#+END_SRC

#+RESULTS: perl5-hello-world-run-test
: t/hello-world.t .. ok
: All tests successful.
: Files=1, Tests=2,  0 wallclock secs ( 0.02 usr  0.00 sys +  0.03 cusr  0.00 csys =  0.05 CPU)
: Result: PASS
*** Perl5 Two Fer Test
#+perl5-two-fer-test
#+BEGIN_SRC perl -n :tangle perl5/two-fer/t/two-fer.t :mkdirp yes
#!/usr/bin/env perl
use strict;
use warnings;
use Test::More tests => 4;
use JSON::PP;
use lib './lib';
use TwoFer qw(two_fer);

can_ok 'TwoFer', 'import' or BAIL_OUT 'Cannot import subroutines from module';

my $C_DATA = do { local $/; decode_json(<DATA>); };
foreach my $case (@{$C_DATA->{cases}}) {
  is two_fer($case->{input}{name}), $case->{expected}, $case->{description};
}

__DATA__
{
  "exercise": "two-fer",
  "version": "1.2.0",
  "cases": [
    {
      "description": "no name given",
      "property": "twoFer",
      "input": {
        "name": null
      },
      "expected": "One for you, one for me."
    },
    {
      "description": "a name given",
      "property": "twoFer",
      "input": {
        "name": "Alice"
      },
      "expected": "One for Alice, one for me."
    },
    {
      "description": "another name given",
      "property": "twoFer",
      "input": {
        "name": "Bob"
      },
      "expected": "One for Bob, one for me."
    }
  ]
}
#+END_SRC

#+name:perl5-two-fer-run-test
#+BEGIN_SRC sh :dir perl5/two-fer :results output :exports both
prove ./t
#+END_SRC

#+RESULTS: perl5-two-fer-run-test
: t/two-fer.t .. ok
: All tests successful.
: Files=1, Tests=4,  0 wallclock secs ( 0.01 usr  0.01 sys +  0.05 cusr  0.00 csys =  0.07 CPU)
: Result: PASS

*** Perl5 Bob Test
#+name:Perl5-Bob-Tests
#+begin_src perl :tangle perl5/bob/t/bob.t :mkdirp yes
#!/usr/bin/env perl
use strict;
use warnings;
use Test::More tests => 26; # This is how many tests we expect to run.
use JSON::PP;
use lib './lib';
use Bob qw(hey);

can_ok 'Bob', 'import' or BAIL_OUT 'Cannot import subroutines from module';

my $C_DATA = do { local $/; decode_json(<DATA>); };
is hey($_->{input}{heyBob}), $_->{expected}, $_->{description} foreach @{$C_DATA->{cases}};

__DATA__
{
  "exercise": "bob",
  "version": "1.4.0",
  "cases": [
    {
      "description": "stating something",
      "property": "response",
      "input": {
        "heyBob": "Tom-ay-to, tom-aaaah-to."
      },
      "expected": "Whatever."
    },
    {
      "description": "shouting",
      "property": "response",
      "input": {
        "heyBob": "WATCH OUT!"
      },
      "expected": "Whoa, chill out!"
    },
    {
      "description": "shouting gibberish",
      "property": "response",
      "input": {
        "heyBob": "FCECDFCAAB"
      },
      "expected": "Whoa, chill out!"
    },
    {
      "description": "asking a question",
      "property": "response",
      "input": {
        "heyBob": "Does this cryogenic chamber make me look fat?"
      },
      "expected": "Sure."
    },
    {
      "description": "asking a numeric question",
      "property": "response",
      "input": {
        "heyBob": "You are, what, like 15?"
      },
      "expected": "Sure."
    },
    {
      "description": "asking gibberish",
      "property": "response",
      "input": {
        "heyBob": "fffbbcbeab?"
      },
      "expected": "Sure."
    },
    {
      "description": "talking forcefully",
      "property": "response",
      "input": {
        "heyBob": "Let's go make out behind the gym!"
      },
      "expected": "Whatever."
    },
    {
      "description": "using acronyms in regular speech",
      "property": "response",
      "input": {
        "heyBob": "It's OK if you don't want to go to the DMV."
      },
      "expected": "Whatever."
    },
    {
      "description": "forceful question",
      "property": "response",
      "input": {
        "heyBob": "WHAT THE HELL WERE YOU THINKING?"
      },
      "expected": "Calm down, I know what I'm doing!"
    },
    {
      "description": "shouting numbers",
      "property": "response",
      "input": {
        "heyBob": "1, 2, 3 GO!"
      },
      "expected": "Whoa, chill out!"
    },
    {
      "description": "no letters",
      "property": "response",
      "input": {
        "heyBob": "1, 2, 3"
      },
      "expected": "Whatever."
    },
    {
      "description": "question with no letters",
      "property": "response",
      "input": {
        "heyBob": "4?"
      },
      "expected": "Sure."
    },
    {
      "description": "shouting with special characters",
      "property": "response",
      "input": {
        "heyBob": "ZOMG THE %^*@#$(*^ ZOMBIES ARE COMING!!11!!1!"
      },
      "expected": "Whoa, chill out!"
    },
    {
      "description": "shouting with no exclamation mark",
      "property": "response",
      "input": {
        "heyBob": "I HATE THE DMV"
      },
      "expected": "Whoa, chill out!"
    },
    {
      "description": "statement containing question mark",
      "property": "response",
      "input": {
        "heyBob": "Ending with ? means a question."
      },
      "expected": "Whatever."
    },
    {
      "description": "non-letters with question",
      "property": "response",
      "input": {
        "heyBob": ":) ?"
      },
      "expected": "Sure."
    },
    {
      "description": "prattling on",
      "property": "response",
      "input": {
        "heyBob": "Wait! Hang on. Are you going to be OK?"
      },
      "expected": "Sure."
    },
    {
      "description": "silence",
      "property": "response",
      "input": {
        "heyBob": ""
      },
      "expected": "Fine. Be that way!"
    },
    {
      "description": "prolonged silence",
      "property": "response",
      "input": {
        "heyBob": "          "
      },
      "expected": "Fine. Be that way!"
    },
    {
      "description": "alternate silence",
      "property": "response",
      "input": {
        "heyBob": "\t\t\t\t\t\t\t\t\t\t"
      },
      "expected": "Fine. Be that way!"
    },
    {
      "description": "multiple line question",
      "property": "response",
      "input": {
        "heyBob": "\nDoes this cryogenic chamber make me look fat?\nNo."
      },
      "expected": "Whatever."
    },
    {
      "description": "starting with whitespace",
      "property": "response",
      "input": {
        "heyBob": "         hmmmmmmm..."
      },
      "expected": "Whatever."
    },
    {
      "description": "ending with whitespace",
      "property": "response",
      "input": {
        "heyBob": "Okay if like my  spacebar  quite a bit?   "
      },
      "expected": "Sure."
    },
    {
      "description": "other whitespace",
      "property": "response",
      "input": {
        "heyBob": "\n\r \t"
      },
      "expected": "Fine. Be that way!"
    },
    {
      "description": "non-question ending with whitespace",
      "property": "response",
      "input": {
        "heyBob": "This is a statement ending with whitespace      "
      },
      "expected": "Whatever."
    }
  ]
}

#+end_src

#+name:Perl5-Bob-Run-Tests
#+begin_src sh :dir perl5/bob :results output :exports both
prove ./t
#+end_src

#+RESULTS: Perl5-Bob-Run-Tests
: t/bob.t .. ok
: All tests successful.
: Files=1, Tests=26,  0 wallclock secs ( 0.01 usr  0.01 sys +  0.06 cusr  0.00 csys =  0.08 CPU)
: Result: PASS

** OCaml Getting Started
To work on the exercises, you will need [[https://opam.ocaml.org][Opam]] and [[https://opensource.janestreet.com/base/][Base]].  Consult [[https://opam.ocaml.org/doc/Install.html][opam]] website
for instructions on how to install =opam= for your OS.

#+name:ocaml-version-info
#+BEGIN_SRC sh :results output :exports both
opam --version
opam switch
ocaml --version
#+END_SRC

#+RESULTS: ocaml-version-info
: 2.0.4
: #  switch               compiler                    description
:    default              ocaml-base-compiler.4.07.0  default
: →  ocaml-base-compiler  ocaml-base-compiler.4.07.1  ocaml-base-compiler
: The OCaml toplevel, version 4.07.1

Once =opam= is installed open a terminal window and run the following command
to install =base= and =core_kernel=:

: opam install base core_kernel

To run the tests you will need =OUnit=.  Install it using =opam=:

: opam install ounit

*** OCaml Hello World Tests
#+name:ocaml-hello-world-tests
#+BEGIN_SRC ocaml :tangle ocaml/hello-world/test.ml :mkdirp yes
open OUnit2
open Hello_world

let ae exp got _test_ctxt = assert_equal ~printer:(fun x -> x) exp got

let tests = [
     "Say Hi!" >:: ae "Hello, World!" hello;
]

let () =
  run_test_tt_main ("Hello World tests" >::: tests)
#+END_SRC

{{{heading(Testing OCaml Hello World)}}}

#+name:ocaml-hello-world-run-tests
#+BEGIN_SRC sh :dir ocaml/hello-world :results output :exports results
echo Running OCaml tests now...
make 2>&1
#+END_SRC

#+RESULTS: ocaml-hello-world-run-tests
: Running OCaml tests now...
: make clean...
: dune clean
: make test...
: dune runtest
:         test alias runtest
: .
: Ran: 1 tests in: 0.11 seconds.
: OK

*** OCaml Leap Solution
#+name:ocaml-leap-solution
#+BEGIN_SRC ocaml :tangle ocaml/leap/leap.ml :mkdirp yes
open Base

let leap_year year =
  let div4   = year %   4 = 0 in
  let div100 = year % 100 = 0 in
  let div400 = year % 400 = 0 in
  div4 && not (div100 && not div400);;
#+END_SRC

#+name:ocaml-leap-solution-interface
#+BEGIN_SRC ocaml :tangle ocaml/leap/leap.mli :mkdirp yes
val leap_year: int -> bool
#+END_SRC

#+name:ocaml-leap-metadata
#+BEGIN_SRC js :tangle ocaml/leap/.exercism/metadata.json :mkdirp yes :exports none
{
    "track":"ocaml",
    "exercise":"leap",
    "id":"e02b0d61e88c451897a35598f9023b70",
    "url":"https://exercism.io/my/solutions/e02b0d61e88c451897a35598f9023b70",
    "handle":"wlharvey4",
    "is_requester":true,
    "auto_approve":false
}
#+END_SRC

#+name:ocaml-leap-solution-submit
#+BEGIN_SRC sh
exercism submit ocaml/leap/leap.ml
#+END_SRC

#+RESULTS: ocaml-leap-solution-submit
: https://exercism.io/my/solutions/e02b0d61e88c451897a35598f9023b70

*** OCaml Leap Tests
#+name:ocaml-leap-tests
#+BEGIN_SRC ocaml :tangle ocaml/leap/test.ml :mkdirp yes
open OUnit2
open Leap

let ae exp got _test_ctxt = assert_equal exp got ~printer:string_of_bool

let tests = [
  "year not divisible by 4: common year" >::
    ae false (leap_year 2015);
  "year divisible by 4, not divisible by 100: leap year" >::
    ae true (leap_year 1996);
  "year divisible by 100, not divisible by 400: common year" >::
    ae false (leap_year 2100);
  "year divisible by 400: leap year" >::
    ae true (leap_year 2000);
  "year divisible by 200, not divisible by 400: common year" >::
    ae false (leap_year 1800);
]

let () =
  run_test_tt_main ("leap tests" >::: tests)
#+END_SRC

#+name:ocaml-leap-makefile
#+BEGIN_SRC make :tangle ocaml/leap/Makefile :mkdirp yes
default: clean test

test:
	dune runtest

clean:
	dune clean

.PHONY: clean
#+END_SRC

#+name:ocaml-leap-make
#+BEGIN_SRC sh :dir ocaml/leap :results output :exports results
make 2>&1
#+END_SRC

#+RESULTS: ocaml-leap-make
: dune clean
: dune runtest
:         test alias runtest
: .....
: Ran: 5 tests in: 0.10 seconds.
: OK

**** OCaml Hamming Submit
#+name:ocaml-hamming-submit
#+begin_src sh :results output :dir ocaml/hamming
exercism submit hamming.ml
#+end_src

#+RESULTS: ocaml-hamming-submit
:     https://exercism.io/my/solutions/0cdcb15b087c451a8e0e71ba614b6ca9

**** OCaml Hamming Run Tests
#+name:ocaml-hamming-run-tests
#+begin_src sh :results output :exports both :dir ocaml/hamming
make 2>&1
#+end_src

#+RESULTS: ocaml-hamming-run-tests
: dune clean
: dune runtest
:         test alias runtest
: ...............
: Ran: 15 tests in: 0.11 seconds.
: OK

